IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_INTXBAR_CONTROLSS_INTXBAR.xml
<module name="CONTROLSS_INTXBAR_CONTROLSS_INTXBAR" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="CONTROLSS_INTXBAR_PID" acronym="CONTROLSS_INTXBAR_PID" offset="0x0" width="32" description="">
		<bitfield id="PID_MSB16" width="16" begin="31" end="16" resetval="0x24960" description="Not Defined" range="31 - 16" rwaccess="RO"/> 
		<bitfield id="PID_MISC" width="5" begin="15" end="11" resetval="0x0" description="Not Defined" range="15 - 11" rwaccess="RO"/> 
		<bitfield id="PID_MAJOR" width="3" begin="10" end="8" resetval="0x2" description="Not Defined" range="10 - 8" rwaccess="RO"/> 
		<bitfield id="PID_CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Not Defined" range="7 - 6" rwaccess="RO"/> 
		<bitfield id="PID_MINOR" width="6" begin="5" end="0" resetval="0x20" description="Not Defined" range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_INTXBAR_INTXBAR0_G0" acronym="CONTROLSS_INTXBAR_INTXBAR0_G0" offset="0x100" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="ETPWM INT interrupt to corresponding xbar1: PWMx.INT is selected0: PWMx.INT is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INTXBAR_INTXBAR0_G1" acronym="CONTROLSS_INTXBAR_INTXBAR0_G1" offset="0x104" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="ETPWM TZINT interrupt to corresponding xbar1: PWMx.TZINT is selected0: PWMx.TZINT is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INTXBAR_INTXBAR0_G2" acronym="CONTROLSS_INTXBAR_INTXBAR0_G2" offset="0x108" width="24" description="">
		<bitfield id="SEL" width="25" begin="24" end="0" resetval="0x0" description="Corresponding INT XBar G2 Input Select0: ADC0.INT11: ADC0.INT22: ADC0.INT33: ADC0.INT44: ADC0.EVTINT5: ADC1.INT16: ADC1.INT27: ADC1.INT38: ADC1.INT49: ADC1.EVTINT10: ADC2.INT111: ADC2.INT212: ADC2.INT313: ADC2.INT414: ADC2.EVTINT15: ADC3.INT116: ADC3.INT217: ADC3.INT318: ADC3.INT419: ADC3.EVTINT20: ADC4.INT121: ADC4.INT222: ADC4.INT323: ADC4.INT424: ADC4.EVTINT" range="24 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INTXBAR_INTXBAR0_G3" acronym="CONTROLSS_INTXBAR_INTXBAR0_G3" offset="0x10C" width="16" description="">
		<bitfield id="SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBar G3 Input Select0: FSIRX0.INT1N1: FSIRX0.INT2N2: FSIRX1.INT1N3: FSIRX1.INT2N4: FSIRX2.INT1N5: FSIRX2.INT2N6: FSIRX3.INT1N7: FSIRX3.INT2N8: FSITX0.INT1N9: FSITX0.INT2N10: FSITX1.INT1N11: FSITX1.INT2N12: FSITX2.INT1N13: FSITX2.INT2N14: FSITX3.INT1N15: FSITX3.INT2N" range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INTXBAR_INTXBAR0_G4" acronym="CONTROLSS_INTXBAR_INTXBAR0_G4" offset="0x110" width="16" description="">
		<bitfield id="SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBar G4 Input Select0: SD0.ERR1: SD0.FILT1.DRINT2: SD0.FILT2.DRINT3: SD0.FILT3.DRINT4: SD0.FILT4.DRINT5: SD1.ERR6: SD1.FILT1.DRINT7: SD1.FILT2.DRINT8: SD1.FILT3.DRINT9: SD1.FILT4.DRINT" range="9 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INTXBAR_INTXBAR0_G5" acronym="CONTROLSS_INTXBAR_INTXBAR0_G5" offset="0x114" width="16" description="">
		<bitfield id="SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBar G5 Input Select0: ECAP0.INT1: ECAP1.INT2: ECAP2.INT3: ECAP3.INT4: ECAP4.INT5: ECAP5.INT6: ECAP6.INT7: ECAP7.INT8: ECAP8.INT9: ECAP9.INT" range="9 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INTXBAR_INTXBAR0_G6" acronym="CONTROLSS_INTXBAR_INTXBAR0_G6" offset="0x118" width="8" description="">
		<bitfield id="SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBar G6 Input Select0: EQEP0.INT1: EQEP1.INT2: EQEP2.INT" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INTXBAR_INTXBAR1_G0" acronym="CONTROLSS_INTXBAR_INTXBAR1_G0" offset="0x140" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="ETPWM INT interrupt to corresponding xbar1: PWMx.INT is selected0: PWMx.INT is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INTXBAR_INTXBAR1_G1" acronym="CONTROLSS_INTXBAR_INTXBAR1_G1" offset="0x144" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="ETPWM TZINT interrupt to corresponding xbar1: PWMx.TZINT is selected0: PWMx.TZINT is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INTXBAR_INTXBAR1_G2" acronym="CONTROLSS_INTXBAR_INTXBAR1_G2" offset="0x148" width="24" description="">
		<bitfield id="SEL" width="25" begin="24" end="0" resetval="0x0" description="Corresponding INT XBar G2 Input Select0: ADC0.INT11: ADC0.INT22: ADC0.INT33: ADC0.INT44: ADC0.EVTINT5: ADC1.INT16: ADC1.INT27: ADC1.INT38: ADC1.INT49: ADC1.EVTINT10: ADC2.INT111: ADC2.INT212: ADC2.INT313: ADC2.INT414: ADC2.EVTINT15: ADC3.INT116: ADC3.INT217: ADC3.INT318: ADC3.INT419: ADC3.EVTINT20: ADC4.INT121: ADC4.INT222: ADC4.INT323: ADC4.INT424: ADC4.EVTINT" range="24 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INTXBAR_INTXBAR1_G3" acronym="CONTROLSS_INTXBAR_INTXBAR1_G3" offset="0x14C" width="16" description="">
		<bitfield id="SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBar G3 Input Select0: FSIRX0.INT1N1: FSIRX0.INT2N2: FSIRX1.INT1N3: FSIRX1.INT2N4: FSIRX2.INT1N5: FSIRX2.INT2N6: FSIRX3.INT1N7: FSIRX3.INT2N8: FSITX0.INT1N9: FSITX0.INT2N10: FSITX1.INT1N11: FSITX1.INT2N12: FSITX2.INT1N13: FSITX2.INT2N14: FSITX3.INT1N15: FSITX3.INT2N" range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INTXBAR_INTXBAR1_G4" acronym="CONTROLSS_INTXBAR_INTXBAR1_G4" offset="0x150" width="16" description="">
		<bitfield id="SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBar G4 Input Select0: SD0.ERR1: SD0.FILT1.DRINT2: SD0.FILT2.DRINT3: SD0.FILT3.DRINT4: SD0.FILT4.DRINT5: SD1.ERR6: SD1.FILT1.DRINT7: SD1.FILT2.DRINT8: SD1.FILT3.DRINT9: SD1.FILT4.DRINT" range="9 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INTXBAR_INTXBAR1_G5" acronym="CONTROLSS_INTXBAR_INTXBAR1_G5" offset="0x154" width="16" description="">
		<bitfield id="SEL" width="10" begin="9" end="0" resetval="0x0" description="Corresponding INT XBar G5 Input Select0: ECAP0.INT1: ECAP1.INT2: ECAP2.INT3: ECAP3.INT4: ECAP4.INT5: ECAP5.INT6: ECAP6.INT7: ECAP7.INT8: ECAP8.INT9: ECAP9.INT" range="9 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INTXBAR_INTXBAR1_G6" acronym="CONTROLSS_INTXBAR_INTXBAR1_G6" offset="0x158" width="8" description="">
		<bitfield id="SEL" width="3" begin="2" end="0" resetval="0x0" description="Corresponding INT XBar G6 Input Select0: EQEP0.INT1: EQEP1.INT2: EQEP2.INT" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INTXBAR_INTXBAR2_G0" acronym="CONTROLSS_INTXBAR_INTXBAR2_G0" offset="0x180" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="ETPWM INT interrupt to corresponding xbar1: PWMx.INT is selected0: PWMx.INT is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INTXBAR_INTXBAR2_G1" acronym="CONTROLSS_INTXBAR_INTXBAR2_G1" offset="0x184" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="ETPWM TZINT interrupt to corresponding xbar1: PWMx.TZINT is selected0: PWMx.TZINT is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INTXBAR_INTXBAR2_G2" acronym="CONTROLSS_INTXBAR_INTXBAR2_G2" offset="0x188" width="24" description="">
		<bitfield id="SEL" width="25" begin="24" end="0" resetval="0x0" description="Corresponding INT XBar G2 Input Select0: ADC0.INT11: ADC0.INT22: ADC0.INT33: ADC0.INT44: ADC0.EVTINT5: ADC1.INT16: ADC1.INT27: ADC1.INT38: ADC1.INT49: ADC1.EVTINT10: ADC2.INT111: ADC2.INT212: ADC2.INT313: ADC2.INT414: ADC2.EVTINT15: ADC3.INT116: ADC3.INT217: ADC3.INT318: ADC3.INT419: ADC3.EVTINT20: ADC4.INT121: ADC4.INT222: ADC4.INT323: ADC4.INT424: ADC4.EVTINT" range="24 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_INTXBAR_INTXBAR2_G3" acronym="CONTROLSS_INTXBAR_INTXBAR2_G3" offset="0x18C" width="16" description="">
		<bitfield id="SEL" width="16" begin="15" end="0" resetval="0x0" description="Corresponding INT XBar G3 Input Select0: FSIRX0.INT1N1: FSIRX0.INT2N2: FSIRX1.INT1N3: FSIRX1.INT2N4: FSIRX2.INT1N5: FSIRX2.INT2N6: FSIRX3.INT1N7: FSIRX3.INT2N8: FSITX0.INT1N9: FSITX0.INT2N10: FSITX1.INT1N11: FSITX1.INT2N12: FSITX2.INT1N13: FSITX2.INT2N14: FSITX3.INT1N15: FSITX3.INT2N" range="15 - 0" rwaccess="RW"/>
	</register>
